<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_14_%EB%91%90%EA%B0%9C%EC%9D%98_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%ED%95%A9%EC%B9%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [ ]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [ ]:
# 행(row)로 합치기
result = pd.concat([df1,df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

df.append
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [ ]:
result = df1.append(df2, ignore_index=True)

In [ ]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 컬럼(열)으로 합칩니다.

In [ ]:
# 열(columns)로 합치기
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])

In [ ]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [ ]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [ ]:
# 열로 합치기
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [ ]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

Bonus
두개의 리스트를 묶어서 데이터프레임으로 생성하기

In [ ]:
# 실제값과 예측값 비교하기
label = [1,2,3,4,5]
prediction = [1,3,2,4,4]

In [ ]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction})

In [ ]:
comparison

   label  prediction
0      1           1
1      2           3
2      3           2
3      4           4
4      5           4